In [1]:
import numpy as np
import pandas as pd

merging 2 dataframes

In [8]:
employees = pd.DataFrame({
    "Employees_id" : [1,2,3,4,5],
    "name" : ['rahul','nitish','shubham','deleep','sonu'],
    "departement" : ["Hr",'IT','sbi','ubi','hr'],
    
})

salaries = pd.DataFrame({
    'Employees_id' : [1,2,3,6,7],
    'salary' : [30000,45333,646664,345464,23435],
    'bonus' : [400,2333,5344,3234,5232],
    
})

In [9]:
employees

   Employees_id     name departement
0             1    rahul          Hr
1             2   nitish          IT
2             3  shubham         sbi
3             4   deleep         ubi
4             5     sonu          hr

In [10]:
salaries

   Employees_id  salary  bonus
0             1   30000    400
1             2   45333   2333
2             3  646664   5344
3             6  345464   3234
4             7   23435   5232

In [14]:
pd.merge(employees,salaries,on='Employees_id',how='inner')

   Employees_id     name departement  salary  bonus
0             1    rahul          Hr   30000    400
1             2   nitish          IT   45333   2333
2             3  shubham         sbi  646664   5344

In [15]:
pd.merge(employees,salaries,on='Employees_id',how='outer')

   Employees_id     name departement    salary   bonus
0             1    rahul          Hr   30000.0   400.0
1             2   nitish          IT   45333.0  2333.0
2             3  shubham         sbi  646664.0  5344.0
3             4   deleep         ubi       NaN     NaN
4             5     sonu          hr       NaN     NaN
5             6      NaN         NaN  345464.0  3234.0
6             7      NaN         NaN   23435.0  5232.0

In [16]:
pd.merge(employees,salaries,on='Employees_id',how='left')

   Employees_id     name departement    salary   bonus
0             1    rahul          Hr   30000.0   400.0
1             2   nitish          IT   45333.0  2333.0
2             3  shubham         sbi  646664.0  5344.0
3             4   deleep         ubi       NaN     NaN
4             5     sonu          hr       NaN     NaN

In [17]:
pd.merge(employees,salaries,on='Employees_id',how='right')

   Employees_id     name departement  salary  bonus
0             1    rahul          Hr   30000    400
1             2   nitish          IT   45333   2333
2             3  shubham         sbi  646664   5344
3             6      NaN         NaN  345464   3234
4             7      NaN         NaN   23435   5232

Concatination 2 DataFrame

In [18]:
df = pd.DataFrame({
    'A' : ["A0","A1","A2"],
    'B' : ['B0','B1','B2'],
    'C' : ['C0','C1','C2'],
    
})

df1 = pd.DataFrame({
    'A': ['A3','A4','A5'],
    'B' : ['B3','B4','B6'],
    'C' : ['C3','C4','C5']
})

In [19]:
df

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [20]:
df1

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B6  C5

In [22]:
pd.concat([df,df1])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B6  C5

In [23]:
pd.concat([df,df1],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B6  C5

**joinging 2 data frames**

In [31]:
df1 = pd.DataFrame({
    'name': ['Manish','Aman','Shivam']
    
},index = [1,2,3])

df2 = pd.DataFrame({
    'score': [90,56,76]
},index = [2,3,4])

In [28]:
df1

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B6  C5

In [32]:
df2

   score
2     90
3     56
4     76

In [33]:
df1.join(df2)

     name  score
1  Manish    NaN
2    Aman   90.0
3  Shivam   56.0

In [34]:
df1.join(df2,how='outer')

     name  score
1  Manish    NaN
2    Aman   90.0
3  Shivam   56.0
4     NaN   76.0

In [35]:
df2.join(df1,how='outer')

   score    name
1    NaN  Manish
2   90.0    Aman
3   56.0  Shivam
4   76.0     NaN